particle-iot/device-os/hal/src/rtl872x/sleep_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHAN'TABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "sleep_hal.h"
#include "gpio_hal.h"
#include "usb_hal.h"
#include "usart_hal.h"
#include "i2c_hal.h"
#include "spi_hal.h"
#include "adc_hal.h"
#include "pwm_hal.h"
#include "flash_common.h"
#include "exflash_hal.h"
#include "rtc_hal.h"
#include "timer_hal.h"
#include "interrupts_hal.h"
#include "concurrent_hal.h"
#include "ble_hal.h"
#include "check.h"
#include "radio_common.h"
#include "spark_wiring_vector.h"
#include "service_debug.h"

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
#include "mcp23s17.h"
#endif
#endif
extern "C" {
#define REALTEK_AMBD_SDK
#include "rtl8721d_pinmux_defines.h"
#include "rtl8721d.h"
}
#include "km0_km4_ipc.h"
#include "backup_ram_hal.h"
#include "dct.h"
#include "dct_hal.h"
#include "align_util.h"
#include "delay_hal.h"
#include "exrtc_hal_internal.h"

#include "../../../system/src/log_file.h" // FIXME

using namespace particle;

extern uintptr_t platform_psram_start;
extern uintptr_t platform_psram_size;

namespace {

uint32_t psramSleepMarker = 0;

constexpr system_tick_t SLEEP_INTERNAL_RTC_MAX_SLEEP_TIME = 32767933;

} // anonymous

class SleepClass {
public:
    int validateSleepConfig(const hal_sleep_config_t* config) {
        CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
        // Checks the sleep mode.
        if (config->mode == HAL_SLEEP_MODE_NONE || config->mode >= HAL_SLEEP_MODE_MAX) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        // Checks the wakeup sources
        auto wakeupSource = config->wakeup_sources;
        uint16_t valid = 0;
        while (wakeupSource) {
            if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                CHECK(validateGpioWakeupSource(config->mode, reinterpret_cast<const hal_wakeup_source_gpio_t*>(wakeupSource)));
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
                CHECK(validateRtcWakeupSource(config->mode, reinterpret_cast<const hal_wakeup_source_rtc_t*>(wakeupSource)));
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
                CHECK(validateUsartWakeupSource(config->mode, reinterpret_cast<const hal_wakeup_source_usart_t*>(wakeupSource)));
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
                CHECK(validateLpcompWakeupSource(config->mode, reinterpret_cast<const hal_wakeup_source_lpcomp_t*>(wakeupSource)));
            } else {
                return SYSTEM_ERROR_NOT_SUPPORTED;
            }
            valid++;
            wakeupSource = wakeupSource->next;
        }
        // At least one wakeup source should be configured for stop and ultra-low power mode.
        if ((config->mode == HAL_SLEEP_MODE_STOP || config->mode == HAL_SLEEP_MODE_ULTRA_LOW_POWER) && (!config->wakeup_sources || !valid)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        return SYSTEM_ERROR_NONE;
    }

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
    void configGpioWakeupSourceExt(const hal_wakeup_source_base_t* wakeupSources, hal_sleep_mode_t sleepMode) {
        const hal_pin_info_t* halPinMap = hal_pin_map();
        auto source = wakeupSources;
        bool config = false;
        uint8_t gpIntEn[2] = {0, 0};
        uint8_t intCon[2] = {0, 0};
        uint8_t defVal[2] = {0, 0};

        while (source) {
            if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                auto gpioWakeup = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
                if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
                    config = true;
                    switch(gpioWakeup->mode) {
                        case RISING: {
                            intCon[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                            break;
                        }
                        case FALLING: {
                            intCon[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                            defVal[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                            break;
                        }
                        case CHANGE:
                        default: {
                            break;
                        }
                    }
                    gpIntEn[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                }
            }
            source = source->next;
        }

        if (config) {
            Mcp23s17::getInstance().writeRegister(Mcp23s17::INTCON_ADDR[0], intCon[0]);
            Mcp23s17::getInstance().writeRegister(Mcp23s17::DEFVAL_ADDR[0], defVal[0]);
            Mcp23s17::getInstance().writeRegister(Mcp23s17::GPINTEN_ADDR[0], gpIntEn[0]);
            Mcp23s17::getInstance().writeRegister(Mcp23s17::INTCON_ADDR[1], intCon[1]);
            Mcp23s17::getInstance().writeRegister(Mcp23s17::DEFVAL_ADDR[1], defVal[1]);
            Mcp23s17::getInstance().writeRegister(Mcp23s17::GPINTEN_ADDR[1], gpIntEn[1]);
        }
    }
#endif // HAL_PLATFORM_MCP23S17
#endif // HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

