particle-iot/device-os/hal/src/rtl872x/sleep_hal.cpp
    /*
     * We're using clock gate on KM4 for stop mode and ultra-low power mode,
     * since the power gate will deinitialize PSRAM and we have to re-initialize
     * and copy code from flash to it. Power gate is used for hibernate mode.
     */
    __attribute__((section(".ram.sleep")))
    int enter(const hal_sleep_config_t* config, hal_wakeup_source_base_t** wakeupReason) {
        CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
        memcpy(&alignedConfig_.config, config, sizeof(hal_sleep_config_t));

        if (config->mode == HAL_SLEEP_MODE_HIBERNATE || config->mode == HAL_SLEEP_MODE_POWER_OFF) {
            /* Backup (sic!) backup RAM into flash */
            hal_backup_ram_sync(nullptr);
#if HAL_PLATFORM_LOG_FILE
            system::closeLogFile();
#endif
        }

        if (config->mode == HAL_SLEEP_MODE_POWER_OFF) {
            return enterPowerOffMode(config);
        }

        for (int usart = 0; usart < HAL_PLATFORM_USART_NUM; usart++) {
            if (hal_usart_is_enabled(static_cast<hal_usart_interface_t>(usart))) {
                hal_usart_flush(static_cast<hal_usart_interface_t>(usart));
            }
        }

        bool bleInitialized = hal_ble_is_initialized(nullptr);
        bool advertising = hal_ble_gap_is_advertising(nullptr) ||
                           hal_ble_gap_is_connecting(nullptr, nullptr) ||
                           hal_ble_gap_is_connected(nullptr, nullptr);
        if (bleInitialized) {
            hal_ble_stack_deinit(nullptr);
            // The delay is essential to make sure the resources are successfully freed.
            // FIXME: Is this still needed? hal_ble_stack_deinit() should wait
            // for deinitialization to complete?
            // Leaving as-is for now, but should be reassessed. We are postponing sleep
            // by 2 seconds all the time.
            HAL_Delay_Milliseconds(2000);
        }

        HAL_USB_Detach();

        hal_interrupt_suspend();

        /* We need to configure the IO expander interrupt before disabling SPI interface. */
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
        Mcp23s17::getInstance().interruptsSuspend();
        configGpioWakeupSourceExt(config->wakeup_sources, config->mode);
#endif
#endif

        // Disable thread scheduling
        os_thread_scheduling(false, nullptr);
        // Disable SysTick
        SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

        if (notifyKm0AndSleep() != SYSTEM_ERROR_NONE) {
            SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
            os_thread_scheduling(true, nullptr);
            return SYSTEM_ERROR_INTERNAL;
        }

        // NOTE: previously checked primask here, no need as if we are going into sleep
        // with disabled interrupts we have much bigger problems
        __disable_irq();

        auto mode = config->mode;

        psramSleepMarker = HAL_READ32(PSRAM_BASE, 0);

        // Clean == flush
        SCB_CleanInvalidateDCache_by_Addr((uint32_t*)&platform_psram_start, (int32_t)(&platform_psram_size));
        // IMPORTANT: DCache and ICache need to be disabled
        SCB_DisableDCache();
        SCB_DisableICache();
        __ISB();
        __DSB();


        // WARNING: any function/data being called/accessed in/after PSRAM being suspended should reside in SRAM
        if (mode == HAL_SLEEP_MODE_HIBERNATE) {
            suspendPsram(false);
        } else {
            suspendPsram(true);
        }

        __SEV(); // signal event, also signal to KM0
        __WFE(); // clear event, immediately exits
        __WFE(); // sleep, waiting for event

        // Only if either stop mode or ultra-low power mode is used, we can get here,
        // which means that the PSRAM retention is enabled, we don't need to re-initialized PSRAM
        resumePsram();

        // Re-enable and invalidate caches
        SCB_EnableICache();
        SCB_InvalidateICache();
        SCB_EnableDCache();
        SCB_InvalidateDCache();
        __ISB();
        __DSB();

        hal_pin_info_t* halPinMap = hal_pin_map();
        hal_pin_t wakeupPin = PIN_INVALID;
        hal_wakeup_source_type_t wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_UNKNOWN;

        // Read the int status before enabling interrupt.
        uint32_t intStatusA = HAL_READ32((uint32_t)GPIOA_BASE, 0x40);
        uint32_t intStatusB = HAL_READ32((uint32_t)GPIOB_BASE, 0x40);

        uint32_t wakeEvent = HAL_READ32(SYSTEM_CTRL_BASE, REG_HS_WAKE_EVENT_STATUS1);
        if (wakeEvent & BIT_HP_WEVT_TIMER_STS) {
            wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_RTC;
        } else if (wakeEvent & BIT_HP_WEVT_GPIO_STS) {
            const hal_wakeup_source_base_t* source = alignedConfig_.config.wakeup_sources;
            while (source) {
                if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                    const hal_wakeup_source_gpio_t* gpioWakeup = (const hal_wakeup_source_gpio_t*)source;
                    hal_pin_info_t* pinInfo = nullptr;
#if HAL_PLATFORM_IO_EXTENSION && HAL_PLATFORM_MCP23S17
                    if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_MCU)
#endif
                    {
                        pinInfo = halPinMap + gpioWakeup->pin;
                    }
#if HAL_PLATFORM_IO_EXTENSION && HAL_PLATFORM_MCP23S17
                    else if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
                        pinInfo = halPinMap + IOE_INT;
                    } else {
                        source = source->next;
                        continue;
                    }
#endif
                    if ((pinInfo->gpio_port == RTL_PORT_A && (intStatusA & (0x01 << pinInfo->gpio_pin)))
                        || (pinInfo->gpio_port == RTL_PORT_B && (intStatusB & (0x01 << pinInfo->gpio_pin)))) {
                        wakeupPin = gpioWakeup->pin;
                        wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_GPIO;
                        break;
                    }
                }
                source = source->next;
            }
        }

