particle-iot/device-os/hal/src/rtl872x/sleep_hal.cpp
        hal_interrupt_restore();

#if HAL_PLATFORM_IO_EXTENSION && HAL_PLATFORM_MCP23S17
        uint8_t intStatus[2];
        Mcp23s17::getInstance().interruptsRestore(intStatus);
        if (halPinMap[wakeupPin].type == HAL_PIN_TYPE_IO_EXPANDER) {
            // We need to identify the exact wakeup pin attached to the IO expander.
            const hal_wakeup_source_base_t* source = alignedConfig_.config.wakeup_sources;
            while (source) {
                if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                    auto gpioWakeup = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
                    uint8_t bitMask = 0x01 << halPinMap[gpioWakeup->pin].gpio_pin;
                    uint8_t port = halPinMap[gpioWakeup->pin].gpio_port;
                    if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
                        if (intStatus[port] & bitMask) {
                            wakeupPin = gpioWakeup->pin;
                            break;
                        }
                    }
                }
                source = source->next;
            }
        }
#endif

        __enable_irq();
        __DSB();
        __ISB();

        // Clear int status
        HAL_WRITE32((uint32_t)GPIOA_BASE, 0x4C, 0xFFFF);
        HAL_WRITE32((uint32_t)GPIOB_BASE, 0x4C, 0xFFFF);

        SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
        os_thread_scheduling(true, nullptr);

        // NOTE: USB stack, BLE stack, malloc require interrupts and thread scheduling to be enabled.
        HAL_USB_Attach();

        int ret = SYSTEM_ERROR_NONE;
        if (wakeupReason) {
            if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                ret = constructWakeupReason((hal_wakeup_source_gpio_t**)wakeupReason, HAL_WAKEUP_SOURCE_TYPE_GPIO, &wakeupPin);
            } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_RTC) {
                ret = constructWakeupReason((hal_wakeup_source_rtc_t**)wakeupReason, HAL_WAKEUP_SOURCE_TYPE_RTC, nullptr);
            } else {
                ret = SYSTEM_ERROR_INTERNAL;
            }
        }

        if (bleInitialized) {
            if (hal_ble_stack_init(nullptr) == SYSTEM_ERROR_NONE && advertising) {
                hal_ble_gap_start_advertising(nullptr);
            }
        }

        return ret;
    }

    static SleepClass* getInstance() {
        static SleepClass sleep;
        static_assert(is_member_aligned_to<32>(sleep.alignedConfig_), "alignof doesn't match");
        return &sleep;
    }

private:
    struct AlignedSleepConfig {
        hal_sleep_config_t config;
        uint32_t padding[4];
    };

    SleepClass()
            : ipcResult_(SYSTEM_ERROR_INTERNAL) {
    }
    ~SleepClass() = default;

    bool isAonPin(hal_pin_t pin) {
        uint16_t rtlPin = hal_pin_to_rtl_pin(pin);
        // PA_21 is also a wakeup source, but it's excluded below since it's
        // only available on MSoM TX2 which is an internal pin for NCP.
        if ((rtlPin >= _PA_12 && rtlPin <= _PA_20) ||
             rtlPin == _PA_25 || rtlPin == _PA_26) {
            return true;
        }
        return false;
    }

    int enterPowerOffMode(const hal_sleep_config_t* config) {
#if HAL_PLATFORM_EXTERNAL_RTC
        hal_exrtc_sleep_config_t sleep = {};
        sleep.version = HAL_EXRTC_API_VERSION;
        sleep.size = sizeof(sleep);
        sleep.exti_mode = CHANGE;

        auto source = config->wakeup_sources;
        while (source) {
            if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                auto gpio = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
                CHECK_TRUE(gpio->type == HAL_PIN_TYPE_RTC, SYSTEM_ERROR_NOT_SUPPORTED);
                CHECK_TRUE(sleep.exti_mode == CHANGE, SYSTEM_ERROR_NOT_SUPPORTED);
                switch (gpio->mode) {
                    case FALLING:
                    case RISING: {
                        sleep.exti_mode = gpio->mode;
                        break;
                    }
                    default: {
                        return SYSTEM_ERROR_NOT_SUPPORTED;
                    }
                }
            } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
                auto rtc = reinterpret_cast<const hal_wakeup_source_rtc_t*>(source);
                CHECK_TRUE(sleep.duration == 0, SYSTEM_ERROR_NOT_SUPPORTED);
                sleep.duration = rtc->ms / 1000;
                CHECK_TRUE(sleep.duration > 0, SYSTEM_ERROR_INVALID_ARGUMENT);
            } else {
                return SYSTEM_ERROR_NOT_SUPPORTED;
            }
            source = source->next;
        }

        return hal_exrtc_command(HAL_EXRTC_INSTANCE_DEFAULT, HAL_EXRTC_COMMAND_SLEEP, &sleep, 0, nullptr);
#else
        return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }

    int validateGpioWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_gpio_t* gpio) {
        switch(gpio->mode) {
            case RISING:
            case FALLING:
            case CHANGE: {
                break;
            }
            default: {
                return SYSTEM_ERROR_INVALID_ARGUMENT;
            }
        }
        if (gpio->type == HAL_PIN_TYPE_RTC) {
            if (mode != HAL_SLEEP_MODE_POWER_OFF) {
                return SYSTEM_ERROR_NOT_SUPPORTED;
            }
            if (gpio->mode == CHANGE) {
                return SYSTEM_ERROR_INVALID_ARGUMENT;
            }
            return SYSTEM_ERROR_NONE;
        }
        if (mode == HAL_SLEEP_MODE_POWER_OFF) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        if (gpio->pin >= TOTAL_PINS) {
            return SYSTEM_ERROR_LIMIT_EXCEEDED;
        }
        if ((mode == HAL_SLEEP_MODE_HIBERNATE || mode == HAL_SLEEP_MODE_POWER_OFF) && !isAonPin(gpio->pin)) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        return SYSTEM_ERROR_NONE;
    }

    int validateLpcompWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_lpcomp_t* lpcomp) {
        if (hal_pin_validate_function(lpcomp->pin, PF_ADC) != PF_ADC) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (lpcomp->trig > HAL_SLEEP_LPCOMP_CROSS) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (mode == HAL_SLEEP_MODE_HIBERNATE || mode == HAL_SLEEP_MODE_POWER_OFF) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        // TODO
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    int validateRtcWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_rtc_t* rtc) {
        if ((rtc->ms / 1000) == 0) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        // It uses a 32.768KHz timer, max counter = 0x3FFFFFFF/32768 * 1000 = 32768000(ms).
        // But due to the simplified calculation formula in SOCPS_AONTimer(), the maximum
        // argument is 32767933, otherwise, the calculated timer counter will overflow.
        if (rtc->ms > SLEEP_INTERNAL_RTC_MAX_SLEEP_TIME) {
#if !HAL_PLATFORM_EXTERNAL_RTC
            return SYSTEM_ERROR_NOT_SUPPORTED;
#else
            if (mode == HAL_SLEEP_MODE_POWER_OFF) {
                hal_exrtc_status_t status = {};
                status.size = sizeof(status);
                status.version = HAL_EXRTC_API_VERSION;
                if (hal_exrtc_get_status(HAL_EXRTC_INSTANCE_DEFAULT, &status, nullptr, nullptr) < 0 || !(status.status & HAL_EXRTC_STATUS_READY)) {
                    return SYSTEM_ERROR_NOT_SUPPORTED;
                }
            } else {
                return SYSTEM_ERROR_NOT_SUPPORTED;
            }
#endif // !HAL_PLATFORM_EXTERNAL_RTC
        }
        return SYSTEM_ERROR_NONE;
    }

    int validateUsartWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_usart_t* usart) {
        if (!hal_usart_is_enabled(usart->serial)) {
            return SYSTEM_ERROR_INVALID_STATE;
        }
        if (mode == HAL_SLEEP_MODE_HIBERNATE || mode == HAL_SLEEP_MODE_POWER_OFF) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        // TODO
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

