particle-iot/device-os/hal/src/rtl872x/sleep_hal.cpp
    template<typename T> int constructWakeupReason(T** wakeupReason, hal_wakeup_source_type_t type, void* data) {
        auto wakeupSource = (T*)malloc(sizeof(T));
        if (wakeupSource) {
            wakeupSource->base.size = sizeof(T);
            wakeupSource->base.version = HAL_SLEEP_VERSION;
            wakeupSource->base.type = type;
            wakeupSource->base.next = nullptr;
            *wakeupReason = wakeupSource;
            if (type == HAL_WAKEUP_SOURCE_TYPE_GPIO && data != nullptr) {
                ((hal_wakeup_source_gpio_t*)wakeupSource)->pin = *((uint16_t*)data);
            }
        } else {
            return SYSTEM_ERROR_NO_MEMORY;
        }
        return SYSTEM_ERROR_NONE;
    }

    int notifyKm0AndSleep() {
        ipcResult_ = SYSTEM_ERROR_INTERNAL;
        DCache_CleanInvalidate((uint32_t)&alignedConfig_.config, sizeof(hal_sleep_config_t));
        int ret = km0_km4_ipc_send_request(KM0_KM4_IPC_CHANNEL_GENERIC, KM0_KM4_IPC_MSG_SLEEP, &alignedConfig_.config,
                sizeof(hal_sleep_config_t), onKm0RespReceived, this);
        if (ret != SYSTEM_ERROR_NONE || ipcResult_ != SYSTEM_ERROR_NONE) {
            return SYSTEM_ERROR_INTERNAL;
        }
        return SYSTEM_ERROR_NONE;
    }

    __attribute__((section(".ram.sleep")))
    void suspendPsram(bool retention) {
        uint32_t temp;
        if (retention) {
            uint32_t temps;
            uint8_t * psram_ca;
            uint32_t PSRAM_datard;
            uint32_t PSRAM_datawr;
            uint8_t PSRAM_CA[6];
            psram_ca = &PSRAM_CA[0];
            /* set psram enter halfsleep mode */
            PSRAM_CTRL_CA_Gen(psram_ca, (BIT11 | BIT0), PSRAM_LINEAR_TYPE, PSRAM_REG_SPACE, PSRAM_READ_TRANSACTION);
            PSRAM_CTRL_DPin_Reg(psram_ca, &PSRAM_datard, PSRAM_READ_TRANSACTION);
            PSRAM_datard |= BIT5;
            temp = PSRAM_datard & 0xff;
            temps = (PSRAM_datard >> 8) & 0xff;
            PSRAM_datawr = ((temp << 8) | (temp << 24)) | (temps | (temps << 16));
            PSRAM_CTRL_CA_Gen(psram_ca, (BIT11 | BIT0), PSRAM_LINEAR_TYPE, PSRAM_REG_SPACE, PSRAM_WRITE_TRANSACTION);
            PSRAM_CTRL_DPin_Reg(psram_ca, &PSRAM_datawr, PSRAM_WRITE_TRANSACTION);

            // Disable memory access from CPU
            // PSRAM_DEV->CSR |= BIT_PSRAM_MEM_IDLE;
            // while(!(PSRAM_DEV->CSR & BIT_PSRAM_MEM_IDLE));

            // Wait for half-sleep entry just in case
            DelayUs(200);
        } else {
            temp = HAL_READ32(SYSTEM_CTRL_BASE_LP, REG_AON_LDO_CTRL1);
            temp &= ~(BIT_LDO_PSRAM_EN);
            HAL_WRITE32(SYSTEM_CTRL_BASE_LP, REG_AON_LDO_CTRL1, temp);
        }
        __ISB();
        __DSB();
    }

    __attribute__((section(".ram.sleep")))
    void resumePsram() {
        // Disable memory access from CPU
        PSRAM_DEV->CSR |= BIT_PSRAM_MEM_IDLE;
        while(!(PSRAM_DEV->CSR & BIT_PSRAM_MEM_IDLE));
        uint8_t PSRAM_CA[6];
        // FIXME: No idea how to align addresses properly here to correctly read things out, reading beginning of PSRAM seems to work though
        PSRAM_CTRL_CA_Gen(PSRAM_CA, 0, PSRAM_LINEAR_TYPE, PSRAM_MEM_SPACE, PSRAM_READ_TRANSACTION);
        for (int i = 0; i < 10; i++) {
            uint32_t temp = 0xaabbccdd;
            PSRAM_DEV->DPDR = 0;
            PSRAM_DEV->CMD_DPIN_NDGE = (PSRAM_CA[0] | (PSRAM_CA[2] << 8) | (PSRAM_CA[4] << 16));
            PSRAM_DEV->CMD_DPIN = (PSRAM_CA[1] | (PSRAM_CA[3] << 8) | (PSRAM_CA[5] << 16));

            PSRAM_DEV->CSR &= (~BIT_PSRAM_DPIN_MODE);
            PSRAM_DEV->CSR |= PSRAM_DPIN_READ_MODE;

            PSRAM_DEV->CCR = BIT_PSRAM_DPIN;
            // 150us should be enough, but we'll anyway retry a few times just in case
            for (int j = 0; j < 150; j++) {
                if (PSRAM_DEV->CCR & BIT_PSRAM_DPIN) {
                    break;
                }
                DelayUs(1);
            }
            if (PSRAM_DEV->CCR & BIT_PSRAM_DPIN) {
                PSRAM_DEV->DPDRI = 0;
                temp = PSRAM_DEV->DPDR;
                if (temp == psramSleepMarker) {
                    break;
                }
            } else {
                PSRAM_DEV->CCR &= ~BIT_PSRAM_DPIN;
            }
        }

        // Enable memory access from CPU
        PSRAM_DEV->CSR &= (~BIT_PSRAM_MEM_IDLE);
        while(PSRAM_DEV->CSR & BIT_PSRAM_MEM_IDLE);
    }

    static void onKm0RespReceived(km0_km4_ipc_msg_t* msg, void* context) {
        if (!msg || !context) {
            return;
        }
        auto instance = (SleepClass*)context;
        if (!msg->data) {
            instance->ipcResult_ = SYSTEM_ERROR_BAD_DATA;
        } else {
            DCache_Invalidate((uint32_t)msg->data, sizeof(int));
            instance->ipcResult_ = ((int32_t*)(msg->data))[0];
        }
    }

    volatile int ipcResult_;
    AlignedSleepConfig __attribute__((aligned(32))) alignedConfig_;
};

int hal_sleep_validate_config(const hal_sleep_config_t* config, void* reserved) {
    return SleepClass::getInstance()->validateSleepConfig(config);
}

int hal_sleep_enter(const hal_sleep_config_t* config, hal_wakeup_source_base_t** wakeup_source, void* reserved) {
    // Check it again just in case.
    CHECK(SleepClass::getInstance()->validateSleepConfig(config));
    return SleepClass::getInstance()->enter(config, wakeup_source);
}
